#+STARTUP: content hideblocks
#+TODO: TODO(t!) FIXME(f!) | DONE(d!) CANCELLED(c@)

* DONE Tags
   DEADLINE: <2023-12-02 Sat>

   - State "DONE"       from "TODO"       [2023-11-09 Thu 23:24]
   - State "TODO"       from              [2023-11-09 Thu 15:12]

- [X] tn (e.g., ~[tn]example[/tn]~)
- [X] spoilers (e.g., ~[spoilers]example[/spoilers]~)
- [X] nodtext (e.g., ~[nodtext]example[/nodtext]~)
- [X] expand (see *[[*Expand Tag]]*)

** DONE Expand Tag
   - State "DONE"       from              [2023-11-09 Thu 23:24]
#+caption: Demonstration
#+begin_src bbcode
[expand]
This creates a collaspible block of text.
[/expand]

[expand=Custom Title]
This creates a collaspible block of text.
[/expand]
#+end_src

** DONE Links
   - State "DONE"       from "TODO"       [2023-11-09 Thu 16:25]
   :LOGBOOK:
   CLOCK: [2023-10-29 Sun 15:09]--[2023-10-29 Sun 15:17] =>  0:08
   CLOCK: [2023-10-29 Sun 15:01]--[2023-10-29 Sun 15:04] =>  0:03
   CLOCK: [2023-10-29 Sun 14:08]--[2023-10-29 Sun 14:33] =>  0:25
   CLOCK: [2023-10-29 Sun 03:28]--[2023-10-29 Sun 03:32] =>  0:04
   CLOCK: [2023-10-29 Sun 02:51]--[2023-10-29 Sun 03:03] =>  0:12
   :END:

#+BEGIN: clocktable :scope subtree :maxlevel 2
#+CAPTION: Clock summary at [2023-11-12 Sun 12:49]
| Headline     | Time    |       |
|--------------+---------+-------|
| *Total time* | *12:04* |       |
|--------------+---------+-------|
| \_  Links    |         | 12:04 |
#+END:

*** DONE URL Links
    DEADLINE: <2023-11-09 Thu 21:00>
    - State "DONE"       from "TODO"       [2023-11-09 Thu 16:24]
    - State "TODO"       from              [2023-11-09 Thu 15:08]
    :LOGBOOK:
    CLOCK: [2023-10-29 Sun 15:26]--[2023-10-29 Sun 16:58] =>  1:32
    :END:

#+BEGIN: clocktable :scope subtree :maxlevel 2
#+CAPTION: Clock summary at [2023-11-12 Sun 12:51]
| Headline     | Time    |
|--------------+---------|
| *Total time* | *11:12* |
|--------------+---------|
#+END:

**** DONE Font Lock
     DEADLINE: <2023-11-09 Thu 21:00>
     - State "DONE"       from "TODO"       [2023-11-09 Thu 16:20]
     - State "TODO"       from              [2023-11-05 Sun 00:09]
     :LOGBOOK:
     CLOCK: [2023-11-09 Thu 15:58]--[2023-11-09 Thu 16:20] =>  0:22
     CLOCK: [2023-11-09 Thu 15:20]--[2023-11-09 Thu 15:51] =>  0:31
     CLOCK: [2023-11-09 Thu 02:21]--[2023-11-09 Thu 03:04] =>  0:43
     CLOCK: [2023-11-08 Wed 22:41]--[2023-11-08 Wed 22:52] =>  0:11
     CLOCK: [2023-11-08 Wed 19:31]--[2023-11-08 Wed 21:31] =>  2:00
     CLOCK: [2023-11-08 Wed 19:15]--[2023-11-08 Wed 19:17] =>  0:02
     CLOCK: [2023-11-08 Wed 13:04]--[2023-11-08 Wed 14:17] =>  1:13
     CLOCK: [2023-11-08 Wed 12:17]--[2023-11-08 Wed 13:04] =>  0:47
     CLOCK: [2023-11-08 Wed 11:46]--[2023-11-08 Wed 11:50] =>  0:04
     CLOCK: [2023-11-07 Tue 20:15]--[2023-11-07 Tue 20:31] =>  0:16
     CLOCK: [2023-11-07 Tue 18:46]--[2023-11-07 Tue 19:10] =>  0:24
     CLOCK: [2023-11-07 Tue 18:35]--[2023-11-07 Tue 18:41] =>  0:06
     CLOCK: [2023-11-05 Sun 00:08]--[2023-11-05 Sun 01:04] =>  0:56
     CLOCK: [2023-10-31 Tue 22:40]--[2023-10-31 Tue 22:47] =>  0:07
     CLOCK: [2023-10-29 Sun 19:08]--[2023-10-29 Sun 19:10] =>  0:02
     CLOCK: [2023-10-29 Sun 17:35]--[2023-10-29 Sun 19:04] =>  1:29
     CLOCK: [2023-10-29 Sun 16:59]--[2023-10-29 Sun 17:26] =>  0:27
     :END:

- [X] bare link (e.g., ~example.com~)
- [X] angled link (e.g., ~<example.com>~
- [X] link with text [3/3]
  - [X] link to an arbitrary URL (e.g., ~"Example":[example.com]~)
  - [X] link to a Danbooru page (e.g., ~"TOS":[/terms_of_service]~)
  - [X] link to a header (e.g., ~"Here":[#dtext-basic-formatting]~)
- [X] Markdown-style link (e.g., ~[Example](example.com)~)
- [X] wiki links [3/3]
  - [X] normal link (e.g., ~[[Kantai Collection]]~)
  - [X] link with alternate text (e.g., ~[[Kantai Collection|Kancolle]]~)
  - [X] link sans qualfieir (e.g., ~[[Fate (series)|]]~)
- [X] search link (e.g. ~{{kantai_collection comic}}~)
- [X] user (e.g., ~@bob~)

#+BEGIN: clocktable :scope subtree :maxlevel 2
#+CAPTION: Clock summary at [2023-11-12 Sun 12:51]
| Headline     | Time   |
|--------------+--------|
| *Total time* | *9:40* |
|--------------+--------|
#+END:

*** DONE Post Links
    - State "DONE"       from "TODO"       [2023-11-08 Wed 11:36]

- [X] link to post (e.g., ~post #1~)
- [X] link to forum topic [2/2]
  - [X] default (page 1) (e.g., ~topic #1~)
  - [X] by page (e.g., page 2) (e.g., ~topic #1/2~)
- [X] link to forum post (e.g., ~forum #1~)
- [X] link to comment (e.g., ~comment #1~)
- [X] link to pool (e.g., ~pool #1~)
- [X] link to favorite group (e.g., ~favgroup #1~)
- [X] link to wiki (e.g., ~wiki #1~)
- [X] link to user (e.g., ~user #1~)
- [X] link to ban (e.g., ~ban #1~)
- [X] link to user feedback (e.g., ~feedback #1~)
- [X] link to ban appeal (e.g., ~appeal #1~)
- [X] link to post flag (e.g., ~flag #1~)
- [X] link to translation note (e.g., ~note #1~)
- [X] link to bulk update request (e.g., ~BUR #1~)
- [X] link to tag alias (e.g., ~alias #1~)
- [X] link to tag implication (e.g., ~implication #1~)
- [X] link to mod action (e.g., ~mod action #1~)
- [X] link to artist (e.g., ~artist #1~)

----------

- [X] link to Github issue (e.g., ~issue #1~)
- [X] link to Pixiv post (e.g., ~pixiv #1~)
- [X] link to Pawoo post (e.g., ~pawoo #1~)
- [X] link to NicoSeiga post (e.g., ~seiga #1~)
- [X] link to Nijie post (e.g., ~nijie #1~)
- [X] link to Twitter post (e.g., ~twitter #1~)
- [X] link to DeviantArt post (e.g., ~deviantart #1~)
- [X] link to ArtStation post (e.g., ~artstation #1~)
- [X] link to Sankaku post (e.g., ~sankaku #1~)
- [X] link to Gelbooru post (e.g., ~gelbooru #1~)
- [X] link to Yande.re post (e.g., ~yandere #1~)

** DONE Headers
   - State "DONE"       from "TODO"       [2023-11-08 Wed 01:38]
   - State "TODO"       from "DONE"       [2023-11-08 Wed 01:37]
   :LOGBOOK:
   CLOCK: [2023-10-29 Sun 20:56]--[2023-10-29 Sun 21:16] =>  0:20
   CLOCK: [2023-10-29 Sun 19:30]--[2023-10-29 Sun 20:40] =>  1:10
   :END:

#+BEGIN: clocktable :scope subtree :maxlevel 2
#+CAPTION: Clock summary at [2023-11-12 Sun 12:52]
| Headline     | Time   |      |
|--------------+--------+------|
| *Total time* | *1:30* |      |
|--------------+--------+------|
| \_  Headers  |        | 1:30 |
#+END:

#+begin_src dtext
h1. Header
h2. Header
h3. Header
h4. Header
h5. Header
h6. Header
#+end_src

These produce headers 1-6, but Danbooru users typically use 4, 5 and 6 in place
of 1, 2, and 3, respectively. But all six headers will become part of the
language regardless. with that in mind...

- [X] Header 1
- [X] Header 2
- [X] Header 3
- [X] Header 4
- [X] Header 5
- [X] Header 6

*** DONE With IDs
    - State "DONE"       from "TODO"       [2023-11-09 Thu 23:22]
    - State "TODO"       from              [2023-11-08 Wed 01:38]

#+begin_src dtext
h4#some-id. Some header
#+end_src

** DONE Lists
   DEADLINE: <2023-11-18 Sat>
   - State "DONE"       from "TODO"       [2023-11-10 Fri 22:11]
   - State "TODO"       from              [2023-11-10 Fri 22:05]

#+caption: A demonstration of lists
#+begin_src dtext
​* item 1
​* item2
​** item 2.a
​** item 2.b
​* item 3
#+end_src

Output:

- item 1
- item2
  - item 2.a
  - item 2.b
- item 3

* Insertion Functions
     DEADLINE: <2023-11-30 Thu>

** DONE Basic tags
  DEADLINE: <2023-11-11 Sat>
  - State "DONE"       from "TODO"       [2023-11-09 Thu 20:12]
  - State "TODO"       from              [2023-11-09 Thu 17:46]
  :LOGBOOK:
  CLOCK: [2023-11-09 Thu 17:51]--[2023-11-09 Thu 20:12] =>  2:21
  :END:

- [X] b
- [X] i
- [X] u
- [X] s
- [X] code
- [X] quote
- [X] expand
- [X] tn
- [X] nodtext
- [X] spoilers

#+BEGIN: clocktable :scope subtree :maxlevel 2
#+CAPTION: Clock summary at [2023-11-12 Sun 12:52]
| Headline       | Time   |      |
|----------------+--------+------|
| *Total time*   | *2:21* |      |
|----------------+--------+------|
| \_  Basic tags |        | 2:21 |
#+END:

** TODO Links
   DEADLINE: <2023-11-30 Thu>
   :LOGBOOK:
   CLOCK: [2023-11-16 Thu 19:20]--[2023-11-16 Thu 22:39] =>  3:19
   :END:
   - State "TODO"       from              [2023-11-09 Thu 23:30]

Links are composed of two parts, the text and the URL. A complete link can be
made in either the DText style or Markdown style. There are, broadly speaking,
three types of DText-style links:

1. A URL link
2. A wiki link
3. A search link

For these kinds of links, the insertion function must know which to
insert. Alternatively, three separate functions can exist for each type.

#+caption: Example of inserting text
#+begin_example
[Input]
C-c C-l l
"URL: " URL
"Text: " Text

[Output]
"Text":[URL]
#+end_example

A function accepts arguments to differentiate the different types of links. It
needs:

1. The link type
2. The URL
3. The text (optional)

----------

- [ ] Markdown (e.g., ~[Text](URL)~)
- [ ] DText [0/3]
  - [ ] URL link (e.g., ~"Text":[URL]~)
  - [ ] Wiki link [0/3]
    - [ ] Default (e.g., ~[​[wiki page (qualifier)]]~)
    - [ ] Without the qualifier(s) (e.g., ~[​[wiki page (qualifier)|]]~)
    - [ ] Alternate text (e.g., ~[​[wiki page (qualifier)|some wiki page]]~)
  - [ ] Search link (e.g., ~{{tag1 tag2 -tag3 tag*}}~)

#+begin_comment
- [ ] link with text (e.g., ~"Example":[example.com]~)
  - [ ] link to a Danbooru page (e.g., ~"TOS":[/terms_of_service]~)
  - [ ] link to a header (e.g., ~"Here":[#dtext-basic-formatting]~)
- [ ] user (e.g., ~@bob~)
#+end_comment

** TODO Tables
   DEADLINE: <2023-11-30 Thu>
   - State "TODO"       from              [2023-11-09 Thu 17:07]

#+caption: Table syntax
#+begin_src bbcode
[table]
  [thead]
    [tr]
      [td]A[/td]
      [td]B[/td]
      [td]C[/td]
    [/tr]
  [/thead]
  [tbody]
    [tr]
      [td]1[/td]
      [td]2[/td]
      [td]3[/td]
    [/tr]
    [tr]
      [td]4[/td]
      [td]5[/td]
      [td]6[/td]
    [/tr]
  [/tbody]
[/table]
#+end_src

This creates the following result:

| A | B | C |
|---+---+---|
| 1 | 2 | 3 |
| 4 | 5 | 6 |

Mainly need a command for inserting tables.

** TODO Sections

   - State "TODO"       from              [2023-11-12 Sun 12:53]

*** TODO External Links Section
    DEADLINE: <2023-12-31 Sun>

    - State "TODO"       from              [2023-11-12 Sun 12:41]

Insert a link at point pointing to a list item in a section called
/External links/.

#+begin_src
Link to external links section
                               ^
#+end_src

After insert:

#+begin_src dtext
Link to external links section "[1]":[#dtext-ext-links]

...

h4. External links

1. [Some link]
   ^
#+end_src
